* CampIII_78b
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | CampIII_78
Place name                       | Nunap Kigdlinga
Geographic location              | Central West Greenland
Site type                        | Ice sheet
Data Source                      | Table in science source
Data DOI                         | 
Science Source                   | Stauffer, B., and H. Oeschger. 1979. Temperaturprofile in bohrloechern am rande des Groenlaendischen Inlandeises. Hydrologie und Glaziologie an der ETH Zurich. Mitteilung Nr. 41.
Science DOI                      | 
Date                             | 1978
Longitude [°E]                   | -50.133
Latitude [°N]                    | 69.717
Location Source                  | MacKinnon, 1980
Depth of top measurement [m]     | 10.0
Depth of bottom measurement [m]  | 90
Ice thickness [m]                | 90
Coverage [% of thickness]        | 89
Ice thickness source             | MacKinnon, 1980
Note                             | See also shallow profiles at boreholes I and III
#+end_example


** Temperature

+ Tabelle I Bohrloch II in https://github.com/GEUS-Glaciology-and-Climate/greenland_ice_borehole_temperature_profiles/files/7185440/stauffer_1979.pdf

** Thickness

** Location

There appears to be multiple historical sites for Camp III - it may have moved. Here we use the location as reported in MacKinnon (1980):

#+BEGIN_QUOTE
@book{mackinnon1980ice,
  title={Ice Cores},
  author={MacKinnon, P.K. and United States. Environmental Data and
          Information Service and World Data Center A for Glaciology},
  series={Glaciological data},
  url={https://books.google.com/books?id=iigcAQAAIAAJ},
  year={1980},
  publisher={World Data Center A for Glaciology [Snow and Ice],
             Institute of Arctic and Alpine Research, University of Colorado}}
#+END_QUOTE

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|  d |    t |
| 10 | -4.4 |
| 15 | -2.8 |
| 20 | -1.8 |
| 30 | -0.6 |
| 40 |  0.0 |
| 50 |  0.0 |
| 60 |  0.7 |
| 70 |  0.7 |
| 80 |  0.8 |
| 90 |  1.0 |

